### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
s1 = pd.Series([4,8,15,16,23,42])
s1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [3]:
l1 = ["BMW","Audi","TATA","Jaguar","Mercedes","Ford","Ferrari","Chevrolet","Maruti Suzuki","Mahindra"]
s2 = pd.Series(l1)
s2

0              BMW
1             Audi
2             TATA
3           Jaguar
4         Mercedes
5             Ford
6          Ferrari
7        Chevrolet
8    Maruti Suzuki
9         Mahindra
dtype: object

### Q3. Create a Pandas DataFrame that contains the following data. Then, print the DataFrame.

In [4]:
data = {
    "Name": ["Alice","Bob","Claire"],
    "Age": [25,30,27],
    "Gender": ["Female","Male","Female"]
}
df1 = pd.DataFrame(data)

In [5]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

- DataFrame is collection of rows and columns presented in a table format. It can read csv files, excel files, etc.
- Series is a equivalent of lists in python. Only difference is in lists it has indexes but doesn't display it, while in series it also displays index which we can specify.
- DataFrame is different from series as there are multiple columns in a dataframe while in series it is only one column with an index column.

In [6]:
print(s2)

0              BMW
1             Audi
2             TATA
3           Jaguar
4         Mercedes
5             Ford
6          Ferrari
7        Chevrolet
8    Maruti Suzuki
9         Mahindra
dtype: object

In [7]:
print(df1)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas have a wide range of functions to manipulate data. Here are some of them:
- df.head(): This will show the first 5 rows of the data frame by default. If we want specified number of rows, we can pass the number as parameter.
- df.tail(): This will show the last 5 rows of the data frame by default. If we want specified number of rows we can pass that number as parameter.
- df.columns: This will show all the column names in the data frame.
- df['column_name']: This will show all the rows for the column specified inside quotation marks. We can also show multiple columns bu passing column names as a list. df[['col1','col2']]

For example, I can use the below function to see only the data I am concerned with.

In [1]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

df[['Survived','Name','Age']].head(5)

   Survived                                               Name   Age
0         0                            Braund, Mr. Owen Harris  22.0
1         1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2         1                             Heikkinen, Miss. Laina  26.0
3         1       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4         0                           Allen, Mr. William Henry  35.0

### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Series and DataFrame are mutable. Panels are not.

### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [5]:
name = pd.Series(["Ramaswamy","Haley","Trump","DeSantis"])
age = pd.Series([43,55,32,44])
gender = pd.Series(["M","F","M","M"])

data = {
    "Name": name,
    "Age": age,
    "Gender": gender
}

df1 = pd.DataFrame(data)
df1

        Name  Age Gender
0  Ramaswamy   43      M
1      Haley   55      F
2      Trump   32      M
3   DeSantis   44      M